stress.yml
config:
  target: "http://localhost:5173"
  phases:
    # Phase 1: Short spike
    - duration: 30        # 30 seconds
      arrivalRate: 5      # start with 5 users/sec
      rampTo: 20         # ramp to 20 users/sec
      name: "Spike traffic test"

    # Sustained load
    - duration: 60       # 1 minute
      arrivalRate: 10     # 10 users/sec constant
      name: "Sustained load test"

scenarios:
  - flow:
      # User visits home page
      - get:
          url: "/"

      # User visits global leaderboard page
      - get:
          url: "/leaderboard"